In [52]:
import pandas as pd

In [53]:
dados = {
    "Nome": ["Taynan", "Luigi", "Samuel", "Agata"],
    "Idade": [98, 20, 200, 100],
    "Cidade": ["Xavantina", "Londres", "Rio de Janeiro", "União Flasco"]
}

In [54]:
data_frame = pd.DataFrame(dados)

In [55]:
data_frame

     Nome  Idade          Cidade
0  Taynan     98       Xavantina
1   Luigi     20         Londres
2  Samuel    200  Rio de Janeiro
3   Agata    100    União Flasco

In [56]:
#Exibir o primeiro elemento
data_frame.head(1)

     Nome  Idade     Cidade
0  Taynan     98  Xavantina

In [57]:
#Exibir o último elemento
data_frame.tail(1)

    Nome  Idade        Cidade
3  Agata    100  União Flasco

In [58]:
dados_notas_disciplinas = {
    "Nome": ["Murilo", "Anthony", "Neymar", "Pajé"],
    "Matemática": [-2123, 67, 98, 32],
    "Física": [-231, 76, 56, 90],
    "Química": [-10, 45, 56, 67],
}

In [59]:
df_notas = pd.DataFrame(dados_notas_disciplinas)

In [60]:
df_notas

      Nome  Matemática  Física  Química
0   Murilo       -2123    -231      -10
1  Anthony          67      76       45
2   Neymar          98      56       56
3     Pajé          32      90       67

In [61]:
media_notas = dados_notas_disciplinas.mean()
df_media = pd.DataFrame(media_notas)

AttributeError: 'dict' object has no attribute 'mean'

In [ ]:
df_media